<? 
//заднание 1

$i = 0;
while($i <= 100) {
    if($i % 3 == 0) {
        echo "$i<br>";
    }
    $i++;
}

?>

<hr>

<?
//задание 2
$i = 0;
do{
    if($i == 0){
        echo "$i - это ноль.<br>";
    }
    elseif($i % 2 == 0){
        echo "$i - это четное число.<br>";
    }
    else {
        echo "$i - это нечетное число.<br>";
    }
    $i++;
        
    } 
while($i <= 10);

?>

<hr>

<?
//задание 3

$regions = ['Московская область' => ['Люберцы', 'Одинцово', 'Красногорск'],
    'Республика Мордовия' => ['Саранск', 'Ковылкино', 'Рузаевка'],
    'Кировская область' => ['Киров', 'Зуевка', 'Омутинск']];

foreach($regions as $region => $city) {
    $str = implode(', ', $city).".";
    echo "$region:<br>$str<br>";
}


?>

<hr>

<?
//задние 4

function rus2translit($trslt) {
    $converter = array(
        'а' => 'a',   'б' => 'b',   'в' => 'v',
        'г' => 'g',   'д' => 'd',   'е' => 'e',
        'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
        'и' => 'i',   'й' => 'y',   'к' => 'k',
        'л' => 'l',   'м' => 'm',   'н' => 'n',
        'о' => 'o',   'п' => 'p',   'р' => 'r',
        'с' => 's',   'т' => 't',   'у' => 'u',
        'ф' => 'f',   'х' => 'h',   'ц' => 'c',
        'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
        'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
        'э' => 'e',   'ю' => 'yu',  'я' => 'ya',

        'А' => 'A',   'Б' => 'B',   'В' => 'V',
        'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
        'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
        'И' => 'I',   'Й' => 'Y',   'К' => 'K',
        'Л' => 'L',   'М' => 'M',   'Н' => 'N',
        'О' => 'O',   'П' => 'P',   'Р' => 'R',
        'С' => 'S',   'Т' => 'T',   'У' => 'U',
        'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
        'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
        'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
        'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya',
    );
    return strtr($trslt, $converter);
}

echo rus2translit('вывожу текст транслитом.');

        ?>
<hr>

<?
//задание 5

function zamenaProbelov($str) {
    return str_replace(" ", "_", $str);
}
 echo zamenaProbelov("Проверяю замену пробелов.");

?>
